Спортклуб/src/InformationRegisters/РасписаниеТренеров/РасписаниеТренеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеТренеров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаСпортсменов</name>
    <type>
      <types>CatalogRef.ГруппыСпортсменов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Спортклуб/src/CommonForms/Планировщик/Module.bsl
# Область СОБЫТИЯ_ФОРМЫ

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)
	
	УдаляемыйЭлемент = Элемент.ВыделенныеЭлементы.Получить(0);
	ДатаНачала = УдаляемыйЭлемент.Начало;
	ДатаКонца = УдаляемыйЭлемент.Конец;
	ЗначенияИзмерений = УдаляемыйЭлемент.ЗначенияИзмерений;
	
	УдалитьЗаписьРасписанияНаСервере(ДатаНачала, ДатаКонца, ЗначенияИзмерений);
	
	ИнициализироватьПланировщик();
	
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СохранитьЭлементПланировщикаНаСервере(Начало, Конец, ЗначенияИзмерений);
	
	ИнициализироватьПланировщик();	
	
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
    
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)

    Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда
        Сообщить("Нет элемента для редактирования");
        Возврат;
    КонецЕсли;

    ИзменяемыйЭлемент = Элемент.ВыделенныеЭлементы.Получить(0);
    
    УдалитьЗаписьРасписанияНаСервере(
    	ИзменяемыйЭлемент.Начало, 
    	ИзменяемыйЭлемент.Конец, 
    	ИзменяемыйЭлемент.ЗначенияИзмерений
    );
    
КонецПроцедуры


&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
        Возврат;
    КонецЕсли;

    Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда
        Сообщить("Нет элемента для редактирования");
        Возврат;
    КонецЕсли;

    ИзменяемыйЭлемент = Элемент.ВыделенныеЭлементы.Получить(0);

    ОбновитьЗаписьРасписанияНаСервере(
        ИзменяемыйЭлемент.Начало,
        ИзменяемыйЭлемент.Конец,
        ИзменяемыйЭлемент.ЗначенияИзмерений
    );
    
    ИнициализироватьПланировщик();
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализироватьПланировщик();
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИнициализироватьПланировщик();
	
КонецПроцедуры

# КонецОбласти


# Область КОМАНДЫ

&НаКлиенте
Процедура Инициализировать(Команда)
	
	ИнициализироватьПланировщик();
	
КонецПроцедуры

# КонецОбласти


# Область ПЛАНИРОВЩИК

&НаКлиенте
Процедура ИнициализироватьПланировщик()  
	
	ПоказатьОповещениеПользователя("Выполняется инициализация планировщика.",,, БиблиотекаКартинок.Сегодня);
	
	ИнициализироватьПланировщикНаСервере();
	
	ПоказатьОповещениеПользователя("Планировщик инициализирован.",,, БиблиотекаКартинок.Сегодня);
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПланировщикНаСервере()  
	
	Планировщик.НачалоПериодаОтображения = НачалоДня(Дата);
	Планировщик.КонецПериодаОтображения	= КонецДня(Дата);
	
	ПериодОтображенияНачало	= Планировщик.НачалоПериодаОтображения + (Константы.ЧасНачалаРабочегоДня.Получить()	- НачалоДня(Константы.ЧасНачалаРабочегоДня.Получить()));
	ПериодОтображенияКонец = Планировщик.НачалоПериодаОтображения + (Константы.ЧасОкончанияРабочегоДня.Получить() - НачалоДня(Константы.ЧасОкончанияРабочегоДня.Получить()));
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(ПериодОтображенияНачало, ПериодОтображенияКонец);
	
	ПланировщикЗаполнитьИзмерения();
	ПланировщикЗаполнитьРасписание();
	
КонецПроцедуры


&НаСервере
Процедура ПланировщикЗаполнитьИзмерения() 
	
	// Инициализируем измерения планировщика
	ИзмеренияПланировщика = Планировщик.Измерения;
	ИзмеренияПланировщика.Очистить();
	 
	ЗапросИзмерения = Новый Запрос(
	"ВЫБРАТЬ
	|	Помещения.Ссылка КАК Помещение
	|ИЗ
	|	Справочник.Помещения КАК Помещения
	|ГДЕ
	|	НЕ Помещения.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тренеры.Ссылка КАК Тренер
	|ИЗ
	|	Справочник.Тренеры КАК Тренеры
	|ГДЕ
	|	НЕ Тренеры.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГруппыСпортсменов.Ссылка КАК ГруппаСпортсменов
	|ИЗ
	|	Справочник.ГруппыСпортсменов КАК ГруппыСпортсменов
	|ГДЕ
	|	НЕ ГруппыСпортсменов.ПометкаУдаления"
	);
	
	// Поиск помещений и тренеров
	РезультатИзмеренияВыполнить = ЗапросИзмерения.ВыполнитьПакет();
	ВыборкаПомещений = РезультатИзмеренияВыполнить[0].Выбрать();
	ВыборкаТренеров = РезультатИзмеренияВыполнить[1].Выбрать();
	ВыборкаГруппСпортсменов = РезультатИзмеренияВыполнить[2].Выбрать();
	
	Отказ = Ложь;
	Если Не ВыборкаПомещений.Количество() Тогда
		глСообщениеПользователю("Не заполнен справочник помещения.", УникальныйИдентификатор);
		Отказ = Истина;
	КонецЕсли;
	Если Не ВыборкаТренеров.Количество() Тогда
		глСообщениеПользователю("Не заполнен справочник тренеры.", УникальныйИдентификатор);
		Отказ = Истина;
	КонецЕсли;
	Если Не ВыборкаГруппСпортсменов.Количество() Тогда
		глСообщениеПользователю("Не заполнен справочник групп спортсменов.", УникальныйИдентификатор);
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Создание группы Помещения
	ИзмерениеПомещения = ИзмеренияПланировщика.Добавить("Помещения");
	Пока ВыборкаПомещений.Следующий() Цикл
		
		// Добавление помещений в группу Помещения
		НовоеПомещение = ИзмерениеПомещения.Элементы.Добавить(ВыборкаПомещений.Помещение);
		НовоеПомещение.Текст = ВыборкаПомещений.Помещение.Наименование;
		
	КонецЦикла;
	
	// Создание измерения Тренеры
	ИзмерениеТренеры = ИзмеренияПланировщика.Добавить("Тренеры");
	Пока ВыборкаТренеров.Следующий() Цикл
		
		// Заполнение измерений тренеры
		НовыйТренер = ИзмерениеТренеры.Элементы.Добавить(ВыборкаТренеров.Тренер);
		НовыйТренер.Текст = ВыборкаТренеров.Тренер.Наименование;
		
	КонецЦикла;
	
	// Создание измерения Спортивные группы
	ИзмерениеГруппыСпортсменов = ИзмеренияПланировщика.Добавить("Группы спортсменов");
	Пока ВыборкаГруппСпортсменов.Следующий() Цикл
		
		// Заполнение измерений тренеры
		НоваяГруппаСпортсменов = ИзмерениеГруппыСпортсменов.Элементы.Добавить(ВыборкаГруппСпортсменов.ГруппаСпортсменов);
		НоваяГруппаСпортсменов.Текст = ВыборкаГруппСпортсменов.ГруппаСпортсменов.Наименование;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПланировщикЗаполнитьРасписание()  
	
	// Инициализация элементов планировщика (записи по измерениям)
	ЭлементыПланировщика = Планировщик.Элементы;
	ЭлементыПланировщика.Очистить();
	
	ЗапросПланы = Новый Запрос(
	"ВЫБРАТЬ
	|	РасписаниеТренеров.Помещение,
	|	РасписаниеТренеров.Тренер,
	|	РасписаниеТренеров.ВремяС,
	|	РасписаниеТренеров.ВремяПо,
	|	РасписаниеТренеров.ГруппаСпортсменов
	|ИЗ
	|	РегистрСведений.РасписаниеТренеров КАК РасписаниеТренеров
	|ГДЕ
	|	РасписаниеТренеров.Период МЕЖДУ &НачалоПериода И &КонецПериода"
	);
	ЗапросПланы.УстановитьПараметр("НачалоПериода",	НачалоДня(Дата));
	ЗапросПланы.УстановитьПараметр("КонецПериода",	КонецДня(Дата));
	
	РезультатПланыВыполнить = ЗапросПланы.Выполнить();
	Если РезультатПланыВыполнить.Пустой() Тогда
		глСообщениеПользователю("Нет планов на выбранную дату.", УникальныйИдентификатор);
		Возврат;
	КонецЕсли;
	
	НачалоДаты = НачалоДня(Дата);
	
	РезультатПланы = РезультатПланыВыполнить.Выбрать();
	Пока РезультатПланы.Следующий() Цикл
		
		// Связка записей с измерениями выполняется через соответствия
		СоответствиеЗначенийИзмерений = Новый Соответствие;
		СоответствиеЗначенийИзмерений.Вставить("Помещения", РезультатПланы.Помещение);
		СоответствиеЗначенийИзмерений.Вставить("Тренеры", РезультатПланы.Тренер);
		СоответствиеЗначенийИзмерений.Вставить("Группы спортсменов", РезультатПланы.ГруппаСпортсменов);
		
		РазницаВремениНачало = РезультатПланы.ВремяС - НачалоДня(РезультатПланы.ВремяС);
		РазницаВремениКонец	= РезультатПланы.ВремяПо - НачалоДня(РезультатПланы.ВремяПо);
		
		Начало = НачалоДаты + РазницаВремениНачало;
		Конец = НачалоДаты + РазницаВремениКонец;
		
		// Добавление новой записи в промежуток времени
		НовыйЭлемент = ЭлементыПланировщика.Добавить(Начало, Конец);
		НовыйЭлемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(СоответствиеЗначенийИзмерений);
		НовыйЭлемент.Текст = РезультатПланы.ГруппаСпортсменов.Наименование;
	КонецЦикла;
	
КонецПроцедуры // ПланировщикЗаполнитьРасписание


&НаСервере
Процедура ОбновитьЗаписьРасписанияНаСервере(ДатаНачала, ДатаКонца, ЗначенияИзмерений)

    Помещение = ЗначенияИзмерений.Получить("Помещения");
    Тренер = ЗначенияИзмерений.Получить("Тренеры");
    Группа = ЗначенияИзмерений.Получить("Группы спортсменов");

    Запрос = Новый Запрос(
    "ВЫБРАТЬ
    |	Период КАК Период,
    |	Помещение КАК Помещение,
    |	Тренер КАК Тренер,
    |	ВремяС КАК ВремяС,
    |	ВремяПо КАК ВремяПо,
    |	ГруппаСпортсменов КАК ГруппаСпортсменов
    |ИЗ
    |	РегистрСведений.РасписаниеТренеров
    |ГДЕ
    |	Тренер = &Тренер
    |	И Помещение = &Помещение
    |	И ГруппаСпортсменов = &Группа
    |	И ВремяС < &НовыйКонец
    |	И ВремяПо > &НовыйНачало"
    );

    Запрос.УстановитьПараметр("Тренер", Тренер);
    Запрос.УстановитьПараметр("Помещение", Помещение);
    Запрос.УстановитьПараметр("Группа", Группа);
    Запрос.УстановитьПараметр("НовыйНачало", ДатаНачала);
    Запрос.УстановитьПараметр("НовыйКонец",  ДатаКонца);

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл
        
        Менеджер = РегистрыСведений.РасписаниеТренеров.СоздатьМенеджерЗаписи();
        Менеджер.Период = Выборка.Период;
        Менеджер.Тренер = Выборка.Тренер;
        Менеджер.Помещение = Выборка.Помещение;
        Менеджер.ГруппаСпортсменов = Выборка.ГруппаСпортсменов;
        Менеджер.ВремяС = Выборка.ВремяС;
        Менеджер.ВремяПо = Выборка.ВремяПо;
        Менеджер.Прочитать();
        Менеджер.Удалить();

    КонецЦикла;

    СохранитьЭлементПланировщикаНаСервере(ДатаНачала, ДатаКонца, ЗначенияИзмерений);
    
КонецПроцедуры


&НаСервере
Процедура УдалитьЗаписьРасписанияНаСервере(ДатаНачала, ДатаКонца, ЗначенияИзмерений)
	
	Помещение = ЗначенияИзмерений.Получить("Помещения");
	Тренер = ЗначенияИзмерений.Получить("Тренеры");
	ГруппаСпортсменов = ЗначенияИзмерений.Получить("Группы спортсменов");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РасписаниеТренеров.Тренер КАК Тренер,
		|	РасписаниеТренеров.Помещение КАК Помещение,
		|	РасписаниеТренеров.ВремяС КАК ВремяС,
		|	РасписаниеТренеров.ВремяПо КАК ВремяПо,
		|	РасписаниеТренеров.ГруппаСпортсменов КАК ГруппаСпортсменов
		|ИЗ
		|	РегистрСведений.РасписаниеТренеров КАК РасписаниеТренеров";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Строка(Выборка.Тренер) = Строка(Тренер) 
		И Строка(Выборка.Помещение) = Строка(Помещение) 
		И Строка(Выборка.ГруппаСпортсменов) = Строка(ГруппаСпортсменов)
		И Выборка.ВремяС - НачалоДня(Выборка.ВремяС) = ДатаНачала - НачалоДня(ДатаНачала)
		И Выборка.ВремяПо - НачалоДня(Выборка.ВремяПо) = ДатаКонца - НачалоДня(ДатаКонца) 
		Тогда
			
			НаборЗаписей = РегистрыСведений.РасписаниеТренеров.СоздатьМенеджерЗаписи();
			НаборЗаписей.ВремяС = ДатаНачала;
			НаборЗаписей.ВремяПо = ДатаКонца;
			НаборЗаписей.Тренер = Выборка.Тренер;
			НаборЗаписей.Помещение = Выборка.Помещение;
			НаборЗаписей.ГруппаСпортсменов = Выборка.ГруппаСпортсменов;
			НаборЗаписей.Период = ДатаНачала;
			НаборЗаписей.Прочитать();
			НаборЗаписей.Удалить();
				
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаСервере
Процедура СохранитьЭлементПланировщикаНаСервере(ДатаНачала, ДатаКонца, ЗначенияИзмерений)
    
    Набор = РегистрыСведений.РасписаниеТренеров.СоздатьНаборЗаписей();
    Набор.Прочитать();
    
    НоваяСтрока = Набор.Добавить();
    НоваяСтрока.Период = ДатаНачала;
    НоваяСтрока.Помещение = ЗначенияИзмерений.Получить("Помещения");
    НоваяСтрока.Тренер = ЗначенияИзмерений.Получить("Тренеры");
    НоваяСтрока.ГруппаСпортсменов = ЗначенияИзмерений.Получить("Группы спортсменов");
    НоваяСтрока.ВремяС = ДатаНачала;
    НоваяСтрока.ВремяПо = ДатаКонца;
	
    Набор.Записать();
	
КонецПроцедуры

# КонецОбласти
